Taurus_MyEEFinal.yml
---
execution:
  concurrency: 10
  executor: jmeter
  hold-for: 3m
  locations:
    europe-west2-a: 3
  ramp-up: 1m
  scenario: Perf2
modules:
  blazemeter:
    dedicated-ips: false
    token: "c797962ab2fbe8836952bfb9:60d99b669484173854c961206cb85149e4218a63f541357ec615ff321217bb1e0f32b43b"
  final-stats: bzt.modules.reporting.FinalStatus
provisioning: cloud
reporting:
  dump-csv: CSVResults.csv
  dump-xml: XMLResults.xml
  failed-labels: true
  module: final-stats
  percentiles: true
  project: MyEE
  report-name: "Taurus myee report"
  summary: true
  summary-labels: true
  test-duration: true
  upload-artifacts: true
scenarios:
  Perf2:
    script: Perf2.jmx
  requests: "http://blazedemo.com/"