Taurus_MyEEFinal.yml
execution:
- executor: jmeter
  concurrency: 10
  hold-for: 3m
  ramp-up: 1m
  locations:
    europe-west2-a: 3
  scenario: Perf2  
    
provisioning: cloud

  
scenarios:
  Perf2:
    script: Perf2.jmx
	
modules:
  blazemeter:
    dedicated-ips: false
    
reporting:
  - module: final-stats
    summary: true  # overall samples count and percent of failures
    percentiles: true  # display average times and percentiles
    summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
    failed-labels: true  # provides list of sample labels with failures
    test-duration: true  # provides test duration
    dump-xml: XMLResults.xml
    dump-csv: CSVResults.csv