Taurus_MyEEFinal.yml
execution:
- scenario: Perf2
  executor: jmeter
  concurrency:
    local: 5
    cloud: 1000
  hold-for: 3m
  ramp-up: 1m
  locations:
    europe-west2-a: 3
provisioning: cloud

scenarios:
  Perf2:
    script: Perf2.jmx

modules:
  cloud:
  report-name: myEEFullReport
  project: myEE
  blazemeter:
    dedicated-ips: true

reporting:
  module: final-stats
  report-name: Taurus myee report
  project: MyEE
  upload-artifacts: true
  summary: true  # overall samples count and percent of failures
  percentiles: true  # display average times and percentiles
  summary-labels: true # provides list of sample labels, status, percentage of completed, avg time and errors
  failed-labels: true  # provides list of sample labels with failures
  test-duration: true  # provides test duration
  dump-xml: XMLResults.xml
  dump-csv: CSVResults.csv